

## Создать репозиторий на GitHub
# Нарисовать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете её в отдельный метод [ФайлНеНайден]"C:\Users\Сергей\Desktop\sxema.jpg")
# Снабдить репозиторий оформленным текстовым описанием решения *(файл README.md)*
# Программа начинается с запроса на ввод исходного массива строк через консоль. 
* Затем создаётся новый массив строк, который будет заполнен только строками, 
удовлетворяющими условиям задачи. 
* static void Main()
    {
        Console.WriteLine("Введите исходный массив строк: ");// Введите  массив строк
        string[] sourceArray = Console.ReadLine().Split(' ');
# Далее идёт цикл for, который проходит по всем элементам исходного массива строк. 
Вслучае длина текущей строки меньше или равна 3 символам, она копируется в новый 
массив строк. Индекс нового массива увеличивается на 1 при каждом добавлении новой строки.
* string[] newArray = new string[sourceArray.Length];// Формируем новый массив из строк, длина которых меньше или равна 3 символам
        int count = 0;
        for (int i = 0; i < sourceArray.Length; i++)
        {
            if (sourceArray[i].Length <= 3)
            {
                newArray[count] = sourceArray[i];
                count++;
            }
        }
# В конце программы выводится новый массив строк на консоль.
*         Console.WriteLine("Новый массив строк:");// Печатаем новый массив
        for (int i = 0; i < count; i++)
        {
            Console.Write(newArray[i] + " ");
        }
    }
}

## Написать программу, решающую поставленную задачу
# Использовать контроль версий в работе над этим небольшим проектом (не должно быть так, что всё залито одним коммитом, как минимум этапы 2, 3, и 4 должны быть расположены в разных коммитах)